/* Класс Settings напрямую связан с пользователем, он хранит в себе параметры, 
которые можно задать для разных запусков алгоритма*/
class Settings {
public:
    Settings(int ns, int ne, int np, int nwe, int nwp, int stlim)          /*ns - число пчел-разведчиков
                                                                             ne - количество элитных участков
                                                                             np - количество перспективных участков
                                                                             nwe - число рабочих пчёл на элитных участках
                                                                             nwp - число рабочих пчёл на перспективных участках
                                                                             stlim - предельное число итераций*/
}